Управление_пожарной_частью_/src/Catalogs/ВозрастныеГруппы/ВозрастныеГруппы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВозрастныеГруппы</name>
  <attributes>
    <name>МинимальныйВозраст</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйВозраст</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Управление_пожарной_частью_/src/Catalogs/Норматив/Норматив.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Норматив</name>
  <hierarchical>true</hierarchical>
  <tabularSections>
    <name>Значения</name>
    <attributes>
      <name>ВозрастнаяГруппа</name>
      <type>
        <types>CatalogRef.ВозрастныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>EnumRef.Оценка</types>
      </type>
    </attributes>
    <attributes>
      <name>МинимальноеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальноеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Управление_пожарной_частью_/src/CommonModules/УправлениеНормативами/Module.bsl
#Область СлужебныеПроцедурыИФункции
Функция ОпределитьВозрастнуюГруппу(ФизЛицо, ДатаПроведения) Экспорт
	
	Если ДатаПроведения = Неопределено Тогда
		ДатаПроведения = ТекущаяДата();
	КонецЕсли;
	
	Возраст = Год(ДатаПроведения) - Год(ФизЛицо.ДатаРождения);
	
	Если Месяц(ДатаПроведения) < Месяц(ФизЛицо.ДатаРождения) 
		ИЛИ (Месяц(ДатаПроведения) = Месяц(ФизЛицо.ДатаРождения) 
		И День(ДатаПроведения) < День(ФизЛицо.ДатаРождения)) Тогда
		Возраст = Возраст - 1;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|    ВозрастныеГруппы.Ссылка КАК Ссылка,
	|    ВозрастныеГруппы.Наименование КАК Наименование
	|ИЗ
	|    Справочник.ВозрастныеГруппы КАК ВозрастныеГруппы
	|ГДЕ
	|   ВозрастныеГруппы.МинимальныйВозраст <= &Возраст
	|	И ВозрастныеГруппы.МаксимальныйВозраст >= &Возраст";
	
	Запрос.УстановитьПараметр("Возраст", Возраст);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДанныеУпражнения(Упражнение, ВозрастнаяГруппа, ДатаПроведения) Экспорт  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Значения.Оценка КАК Оценка,
	|	Значения.МинимальноеЗначение КАК МинимальноеЗначение,
	|	Значения.МаксимальноеЗначение КАК МаксимальноеЗначение
	|ИЗ
	|	Справочник.Норматив.Значения КАК Значения
	|ГДЕ
	|	Значения.Ссылка = &Норматив
	|	И Значения.ВозрастнаяГруппа = &ВозрастнаяГруппа
	|УПОРЯДОЧИТЬ ПО
	|	Значения.Оценка УБЫВ";
	
	Запрос.УстановитьПараметр("Норматив", Упражнение);
	Запрос.УстановитьПараметр("ВозрастнаяГруппа", ВозрастнаяГруппа);
	
	Результат = Запрос.Выполнить();
	Данные = Результат.Выгрузить();
	
	Возврат Данные;
	
КонецФункции

Функция РассчитатьОценку(Результат, ДанныеУпражнения) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат = NULL Тогда
		Возврат "Не выполнял";
	КонецЕсли;

	Попытка
		ЧислоРезультат = Число(СтрЗаменить(Строка(Результат), ",", "."));
	Исключение
		Возврат "Не выполнил";
	КонецПопытки;

	Отлично = Неопределено;
	Хорошо = Неопределено;
	Удовл = Неопределено;

	Для Каждого Норматив Из ДанныеУпражнения Цикл
		Оценка = СокрЛП(Норматив.Оценка);
	
	Если Оценка = "Отлично" Тогда
		Отлично = Норматив;
	ИначеЕсли Оценка = "Хорошо" Тогда
		Хорошо = Норматив;
	ИначеЕсли Оценка = "Удовлетворительно" Тогда
		Удовл = Норматив;
	КонецЕсли;
	КонецЦикла;
	
	МеньшеЛучше = Ложь;
	Если Удовл <> Неопределено И Хорошо <> Неопределено Тогда
		МеньшеЛучше = (Удовл.МинимальноеЗначение > Хорошо.МинимальноеЗначение);
	КонецЕсли;
	
	Если Отлично <> Неопределено Тогда
		Если МеньшеЛучше Тогда
			Если ЧислоРезультат <= Отлично.МаксимальноеЗначение Тогда
				Возврат "отлично";
			КонецЕсли;
		Иначе
			Если ЧислоРезультат >= Отлично.МинимальноеЗначение Тогда
				Возврат "отлично";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Хорошо <> Неопределено Тогда
		Если ЧислоРезультат >= Хорошо.МинимальноеЗначение 
			И ЧислоРезультат <= Хорошо.МаксимальноеЗначение Тогда
			Возврат "хорошо";
		КонецЕсли;
	КонецЕсли;
	
	Если Удовл <> Неопределено Тогда
		Если ЧислоРезультат >= Удовл.МинимальноеЗначение 
			И ЧислоРезультат <= Удовл.МаксимальноеЗначение Тогда
			Возврат "удовлетворительно";
		КонецЕсли;
	КонецЕсли;
	
	Возврат "Не сдал";
	
КонецФункции

Функция РассчитатьОценкуПоСотруднику(Сотрудник, Упражнение, Результат, ДатаПроведения = Неопределено) Экспорт
	
	ВозрастнаяГруппа = ОпределитьВозрастнуюГруппу(Сотрудник, ДатаПроведения);
	
	Если ВозрастнаяГруппа = Неопределено Тогда
		Возврат "Нет возрастной группы";
	КонецЕсли;
	
	ДанныеУпражнения = ПолучитьДанныеУпражнения(Упражнение, ВозрастнаяГруппа, ДатаПроведения);
	
	Если ДанныеУпражнения.Количество() = 0 Тогда
		Возврат "Нет данных";
	КонецЕсли;
	
	Оценка = РассчитатьОценку(Результат, ДанныеУпражнения);
	
	Возврат Оценка;
	
КонецФункции

Функция ПолучитьДанныеПоОценке(ДанныеУпражнения, Оценка) Экспорт
	
	Для Каждого Данные Из ДанныеУпражнения Цикл
		Если Данные.Оценка = Оценка Тогда
			Возврат Данные;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции
#КонецОбласти
